000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.НастройкиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/СтруктураУзлов/СтруктураУзлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураУзлов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>MSDyn_CRM</name>
      <description>MS Dynamics CRM</description>
    </items>
    <items>
      <name>КСУ_Navision</name>
      <description>Корпоративная Система Управления (внешний источник Navision)</description>
    </items>
    <items>
      <name>ЦентральныйОфис</name>
      <description>ЦЕНТРАЛЬНЫЙ ОФИС</description>
    </items>
  </predefined>
  <attributes>
    <name>Account</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BaseName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУзла</name>
    <type>
      <types>EnumRef.ВидыУзлов</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловОбновления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловРезервныхКопий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПрограммы</name>
    <type>
      <types>EnumRef.ПрограммаМобильногоУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧрезвычайноеПоложение</name>
    <comment>Вне доступа из-за войны</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Алгоритмы</name>
    <attributes>
      <name>Алгоритм</name>
      <comment>Алгоритм, назначенный для выполнения в текущем узле</comment>
      <type>
        <types>CatalogRef.Алгоритмы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнятьАлгоритм</name>
      <type>
        <types>EnumRef.ВыполнятьАлгоритм</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Магазины</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроизвольныеДанные</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезервныеКопии</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СетевыеИнтерфейсы</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ЗначениеНастроек/Module.bsl
//	LNK 21.04.2017 12:03:34
Процедура УстановитьОрганизациюПоУмолчанию(Организация, Знач Пользователь = Неопределено, УстановитьНастройкуПользователя = Истина)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если Пользователь = Неопределено Тогда

		Пользователь = Пользователи.ТекущийПользователь();

	КонецЕсли;

	ОрганизацияМагазина = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийМагазин, "Организация", Справочники.Организации.ПустаяСсылка(), Ложь);

	Если НЕ Организация = ОрганизацияМагазина Тогда

		Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		//	В Центральной базе мы не сможет однозначно установить магазин по организации... таких тут много.
		//	Поэтому откатываемся к организации, указанной для магазина.
			Организация = ОрганизацияМагазина;

		Иначе

		//	А здесь магазины, имеющие место в узле, хранятся в элементе структуры данных.
		//	Вот из этих магазинов и выбираем по нужной организации. Если такой не найдём, то
		//	результат будет такой же, как и в "верхней" ветке условия.
			ДанныеУзла = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла();

			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
			|	МагазиныУзла.Магазин,
			|	МагазиныУзла.Магазин.НомерМагазина КАК КлючПорядка
			|ИЗ
			|	Справочник.СтруктураУзлов.Магазины КАК МагазиныУзла
			|ГДЕ
			|	МагазиныУзла.Ссылка = &ЭлементСтруктуры
			|	И МагазиныУзла.Магазин.Организация = &Организация
			|			И НЕ МагазиныУзла.Магазин.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|
			|УПОРЯДОЧИТЬ ПО
			|	КлючПорядка"
			);
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("ЭлементСтруктуры", ДанныеУзла.ЭлементСтруктуры);

			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Следующий() Тогда

				ПараметрыСеанса.ТекущийМагазин = Выборка.Магазин;

			Иначе

				Организация = ОрганизацияМагазина;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	ПараметрыСеанса.ТекущаяОрганизация = Организация;

	Если УстановитьНастройкуПользователя Тогда

		МенеджерЗаписи = РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = Пользователь;
		МенеджерЗаписи.Магазин      = ПараметрыСеанса.ТекущийМагазин;
		МенеджерЗаписи.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация;
		МенеджерЗаписи.Значение     = ПараметрыСеанса.ТекущаяОрганизация;

		МенеджерЗаписи.Записать();

	КонецЕсли;

КонецПроцедуры
